### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-14T21:33:13.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:25",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:21" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:21/invocations" -> (known after apply)
!       role                           = "arn:aws:iam::350131064538:role/service-role/cataprato-role-0cqzd0zs" -> "arn:aws:iam::350131064538:role/tf-managed/cataprato-auth-lambda"
!       s3_key                         = "lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip" -> "lambda-builds/5bd89bc39b16714c98c8d140c2f1cff7683992169eeaa0a75533027e22d6424c.zip"
!       s3_object_version              = "s085d.0EQs.mj3ADk2iiinhE7lR.UG6H" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       timeout                        = 10 -> 3
!       version                        = "21" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "21" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "dc10575a8ddec367c87dad41badfe66b" -> (known after apply)
!       id                     = "lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip" -> (known after apply)
!       key                    = "lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip" -> "lambda-builds/5bd89bc39b16714c98c8d140c2f1cff7683992169eeaa0a75533027e22d6424c.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip" -> "./.terraform/lambda-builds/5bd89bc39b16714c98c8d140c2f1cff7683992169eeaa0a75533027e22d6424c.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "s085d.0EQs.mj3ADk2iiinhE7lR.UG6H" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./src",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/5bd89bc39b16714c98c8d140c2f1cff7683992169eeaa0a75533027e22d6424c.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/5bd89bc39b16714c98c8d140c2f1cff7683992169eeaa0a75533027e22d6424c.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "979591240224078013" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip" -> "./.terraform/lambda-builds/5bd89bc39b16714c98c8d140c2f1cff7683992169eeaa0a75533027e22d6424c.zip"
!           "timestamp" = "1691900904610610000" -> "1692051074610835000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "6128571541754561493" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/e411b3747d7c97d575ff4a4b958a379045286ab859f4a97534c1323bda97bf9e.zip" -> "./.terraform/lambda-builds/5bd89bc39b16714c98c8d140c2f1cff7683992169eeaa0a75533027e22d6424c.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:25" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-13T04:29:22.620+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:25" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/3d708a4162501228e332f05b04be62b408c6bfcb29f9a72aad0a9a294b617aa5.zip" -> "builds/24a65f721cb6c516af2369d6fd3d7b9d356b0174c59c7cf67500002dccd55833.zip"
!       s3_object_version           = "zfzgIQoBRvg6VcwvWoqBVXF_v6hfJeAf" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "J4yzG2+NNjYHtg/9alHm3IQqaxVB50+SKnPj9R5NDyo=" -> (known after apply)
!       source_code_size            = 29713991 -> (known after apply)
!       version                     = "25" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "b37b5c12fd00c0728493c7e6efafa8d8-6" -> (known after apply)
!       id                     = "builds/3d708a4162501228e332f05b04be62b408c6bfcb29f9a72aad0a9a294b617aa5.zip" -> (known after apply)
!       key                    = "builds/3d708a4162501228e332f05b04be62b408c6bfcb29f9a72aad0a9a294b617aa5.zip" -> "builds/24a65f721cb6c516af2369d6fd3d7b9d356b0174c59c7cf67500002dccd55833.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/3d708a4162501228e332f05b04be62b408c6bfcb29f9a72aad0a9a294b617aa5.zip" -> "builds/24a65f721cb6c516af2369d6fd3d7b9d356b0174c59c7cf67500002dccd55833.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "zfzgIQoBRvg6VcwvWoqBVXF_v6hfJeAf" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/24a65f721cb6c516af2369d6fd3d7b9d356b0174c59c7cf67500002dccd55833.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/24a65f721cb6c516af2369d6fd3d7b9d356b0174c59c7cf67500002dccd55833.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "1789163856163780256" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/3d708a4162501228e332f05b04be62b408c6bfcb29f9a72aad0a9a294b617aa5.zip" -> "builds/24a65f721cb6c516af2369d6fd3d7b9d356b0174c59c7cf67500002dccd55833.zip"
!           "timestamp" = "1691900906190195000" -> "1692051076292714200"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "4326049765216701746" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/3d708a4162501228e332f05b04be62b408c6bfcb29f9a72aad0a9a294b617aa5.zip" -> "builds/24a65f721cb6c516af2369d6fd3d7b9d356b0174c59c7cf67500002dccd55833.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>